In [18]:
import pandas as pd
import numpy as np

In [2]:
import re

In [3]:
df = pd.read_csv(r'scrubbed.csv', dtype={'duration (seconds)': 'string', 'latitude': 'string'})
df.head()

,datetime,city,state,country,shape,duration (seconds),duration (hours/min),comments,date posted,latitude,longitude
0,10/10/1949 20:30,san marcos,tx,us,cylinder,2700,45 minutes,This event took place in early fall around 194...,4/27/2004,29.8830556,-97.941111
1,10/10/1949 21:00,lackland afb,tx,NaN,light,7200,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.38421,-98.581082
2,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.2,-2.916667
3,10/10/1956 21:00,edna,tx,us,circle,20,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.9783333,-96.645833
4,10/10/1960 20:00,kaneohe,hi,us,light,900,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.4180556,-157.803611

In [4]:
df['duration (seconds)'] = df['duration (seconds)'].str.extract('(\d+)').astype(float)
df['latitude'] = df['latitude'].str.extract('(\d+)').astype(float)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80332 entries, 0 to 80331
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   datetime              80332 non-null  object
 1   city                  80332 non-null  object
 2   state                 74535 non-null  object
 3   country               70662 non-null  object
 4   shape                 78400 non-null  object
 5   duration (seconds)    80332 non-null  float64
 6   duration (hours/min)  80332 non-null  object
 7   comments              80317 non-null  object
 8   date posted           80332 non-null  object
 9   latitude              80332 non-null  float64
 10  longitude             80332 non-null  float64
dtypes: float64(3), object(8)
memory usage: 6.7+ MB

In [6]:
df['city'] = df['city'].str.title()

In [8]:
df['state'] = df['state'].str.upper()

In [9]:
df['country'] = df['country'].str.upper()

In [12]:
df.head()

,datetime,city,state,country,shape,duration (seconds),duration (hours/min),comments,date posted,latitude,longitude
0,10/10/1949 20:30,San Marcos,TX,US,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,4/27/2004,29.0,-97.941111
1,10/10/1949 21:00,Lackland Afb,TX,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.0,-98.581082
2,10/10/1955 17:00,Chester (Uk/England),NaN,GB,circle,20.0,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.0,-2.916667
3,10/10/1956 21:00,Edna,TX,US,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.0,-96.645833
4,10/10/1960 20:00,Kaneohe,HI,US,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.0,-157.803611

In [16]:
pd.concat

<function pandas.core.reshape.concat.concat(objs: Union[Iterable[Union[ForwardRef('DataFrame'), ForwardRef('Series')]], Mapping[Union[Hashable, NoneType], Union[ForwardRef('DataFrame'), ForwardRef('Series')]]], axis=0, join='outer', ignore_index: bool = False, keys=None, levels=None, names=None, verify_integrity: bool = False, sort: bool = False, copy: bool = True) -> Union[ForwardRef('DataFrame'), ForwardRef('Series')]>

In [19]:
df1 = pd.DataFrame(np.random.rand(3,2),
                  columns = ['cat', 'dog'])
df2 = pd.DataFrame(np.random.rand(3,2),
                  columns = ['cat', 'dog'])

In [23]:
df3 = pd.concat([df1,df2], ignore_index=True)
df3

        cat       dog
0  0.209084  0.846385
1  0.099845  0.076545
2  0.292979  0.570684
3  0.392273  0.881560
4  0.884438  0.570523
5  0.452248  0.423795

In [29]:
df4 = pd.DataFrame(np.random.rand(3,2),
                  columns = ['bird', 'horse'])

In [30]:
df1, df4

(        cat       dog
 0  0.209084  0.846385
 1  0.099845  0.076545
 2  0.292979  0.570684,
        bird     horse
 0  0.075547  0.639507
 1  0.396120  0.202480
 2  0.762556  0.616517)

In [36]:
pd.concat([df1,df2], axis=1)

        cat       dog       cat       dog
0  0.209084  0.846385  0.392273  0.881560
1  0.099845  0.076545  0.884438  0.570523
2  0.292979  0.570684  0.452248  0.423795

In [35]:
pd.concat([df1,df4], axis=1)

        cat       dog      bird     horse
0  0.209084  0.846385  0.075547  0.639507
1  0.099845  0.076545  0.396120  0.202480
2  0.292979  0.570684  0.762556  0.616517

In [44]:
df5 = pd.DataFrame({'Alpaca':['A1', 'A2', 'A3'], 'Bird':['B1', 'B2', 'B3'],
        'Camel':['C1', 'C2', 'C3']})

In [45]:
df5

  Alpaca Bird Camel
0     A1   B1    C1
1     A2   B2    C2
2     A3   B3    C3

In [46]:
df6 = pd.DataFrame({'Bird':['B3', 'B4', 'B5'], 'Camel':['C3', 'C4', 'C5'],
        'Duck':['D3', 'D4', 'D5']} , index=[3,4,5])

In [47]:
df6

  Bird Camel Duck
3   B3    C3   D3
4   B4    C4   D4
5   B5    C5   D5

In [54]:
print(pd.concat([df5, df6]))

  Alpaca Bird Camel Duck
0     A1   B1    C1  NaN
1     A2   B2    C2  NaN
2     A3   B3    C3  NaN
3    NaN   B3    C3   D3
4    NaN   B4    C4   D4
5    NaN   B5    C5   D5

In [56]:
print(pd.concat([df5, df6], join='inner'))

  Bird Camel
0   B1    C1
1   B2    C2
2   B3    C3
3   B3    C3
4   B4    C4
5   B5    C5